rt/bindings/soap2/src/test/resources/org/objectweb/celtix/bindings/soap2/attachments/primarySoapPart.xml

<soap:Envelope xmlns:soap='http://www.w3.org/2003/05/soap-envelope'
	xmlns:xmlmime='http://www.w3.org/2004/11/xmlmime'>
	<soap:Body>
		<m:data xmlns:m='http://example.org/stuff'>
			<m:photo xmlmime:contentType='image/png'>
				<xop:Include xmlns:xop='http://www.w3.org/2004/08/xop/include'
					href='cid:http://celtix.objectweb.org/me.jpg'/>
			</m:photo>
			<m:sig xmlmime:contentType='audio/x-wav'>
				<xop:Include xmlns:xop='http://www.w3.org/2004/08/xop/include'
					href='cid:http://celtix.objectweb.org/my.wav'/>
			</m:sig>
		</m:data>
	</soap:Body>
</soap:Envelope>